[
  {
    "name": "Baigan",
    "dialogue": "Ah, the young lord returns triumphant! You did secure Mysidia's Crystal, did you not?"
  },
  {
    "name": "Cecil",
    "dialogue": "The Crystal is ours. But the Mysidians - they did not even raise a hand in their own defense, Baigan."
  },
  {
    "name": "Baigan",
    "dialogue": "All's the better, then, is it not? Only fools would dare oppose the almighty will of Baron. Come, we must not keep His Majest waiting. They walk to the throne room."
  },
  {
    "name": "Baigan",
    "dialogue": "A moment, my lord. Baigan leaves Cecil just outside."
  },
  {
    "name": "Baigan",
    "dialogue": "Your Majest, I fear our good Lord Cecil's faith in you begins to waver."
  },
  {
    "name": "King of Baron",
    "dialogue": "Does it, now? Indeed. Your loyalty and worth are proven once again, Captain Baigan. But the Crystal is all that matters. Bring him before me."
  },
  {
    "name": "Baigan",
    "dialogue": "As you wish. Lord Cecil, His Majesty bids you enter! Cecil does so and kneels."
  },
  {
    "name": "King of Baron",
    "dialogue": "The kingdom of Baron hails your return, Cecil. You have brought me the Crystal, I trust?"
  },
  {
    "name": "Cecil",
    "dialogue": "I have, Your Majesty. Cecil hands the Water Crystal to Baigan, who delivers it to the king."
  },
  {
    "name": "Baigan",
    "dialogue": "It is genuine, Your Majest."
  },
  {
    "name": "King of Baron",
    "dialogue": "So it is. See how it shines! That will be all, Cecil. You may leave us now. Cecil turns to go, but hesitates."
  },
  {
    "name": "Cecil",
    "dialogue": "...Your Majesty!"
  },
  {
    "name": "King of Baron",
    "dialogue": "Have you some other matter to discuss?"
  },
  {
    "name": "Baigan",
    "dialogue": "Our king has granted you your leave, and yet you would trouble him further?"
  },
  {
    "name": "Cecil",
    "dialogue": "I know it is not my place to ask, Your Majesty, and I pray ou can forgive my indiscretion. But what is it you aim to do? Your ways are not as they once were. My men's hearts grow heavy witih misgiving."
  },
  {
    "name": "King of Baron",
    "dialogue": "As does yours?"
  },
  {
    "name": "Cecil",
    "dialogue": "Your Majesty, no, I would never doubt-"
  },
  {
    "name": "King of Baron",
    "dialogue": "Do you take me for a fool, Cecil? Do you think your treasonous whisperings escape my ears? After all I've done for you, Cecil...You wound me. This is most unfortunate, but I can place no trust in one who offers none in return. I hereby relieve you of command of the Red Wings."
  },
  {
    "name": "Cecil",
    "dialogue": "My liege!"
  },
  {
    "name": "King of Baron",
    "dialogue": "You will go now of the Valley of Mist instead. There is a task I would have you do. A phantom creature haunts the borders of that land - the Eidolon of Mist. You will slay it, and deliver this ring to the village that lies beyond - they will know its meaning. Be gone at first light on the morrow."
  },
  {
    "name": "Voice",
    "dialogue": "Your Majesty! Cecil's friend, Kain, Commander of the Baron Dragoons, enters."
  },
  {
    "name": "Kain",
    "dialogue": "I beg you, my liege, reconsider! You know Cecil would not betray you!"
  },
  {
    "name": "King of Baron",
    "dialogue": "Ah, Kain. I was not aware this matter concerned you. But as you seem so eager to protect your friend, let your spear accompany his blade on the road to Mist."
  },
  {
    "name": "Cecil",
    "dialogue": "Your Majesty-!"
  },
  {
    "name": "King of Baron",
    "dialogue": "I've no more words. Take the ring and begone, while my mood is yet fair! Cecil and Kain are given the Carnelian Signet and escorted out of the room."
  },
  {
    "name": "Cecil",
    "dialogue": "My liege!"
  },
  {
    "name": "Cecil",
    "dialogue": "Kain, forgive me. I did not mean to draw you into this."
  },
  {
    "name": "Kain",
    "dialogue": "What's to forgive? We'll slay this Eidolon of his and all will be forgotten. You'll be commanding the Red Wings again before you know it."
  },
  {
    "name": "Cecil",
    "dialogue": "Kain..."
  },
  {
    "name": "Kain",
    "dialogue": "You must be tired from Mysidia, no? Leave the preparations to me and get yourself some rest. Cecil explores the castle for a moment before returning to his bedchamber. He visits Kain in the company of his subordinate dragoons."
  },
  {
    "name": "Kain",
    "dialogue": "What is it?"
  },
  {
    "name": "Cecil",
    "dialogue": "This is all my doing. Forgive me."
  },
  {
    "name": "Kain",
    "dialogue": "I told you, there's nothing to forgive. What's wrong? It isn't like you to act like this."
  },
  {
    "name": "Cecil",
    "dialogue": "I did not train in the way of the dark sword so I could steal from innocents, Kain. I trained because His Majesty asked it of me."
  },
  {
    "name": "Kain",
    "dialogue": "You mustn't blame yourself for the orders you were given. Our king had his reason, I'm sure of it."
  },
  {
    "name": "Cecil",
    "dialogue": "I envy you, Kain. Flashback to where Kain and Cecil spar in Baron's courtyard."
  },
  {
    "name": "Kain",
    "dialogue": "Cecil...So you saw me."
  },
  {
    "name": "Cecil",
    "dialogue": "I saw the openings you left. How do you expect to lead the Dragoons if you cannot even guard your own flank?"
  },
  {
    "name": "Kain",
    "dialogue": "My father's blood is in me. I will lead the Dragoons! Have no fear of that."
  },
  {
    "name": "Cecil",
    "dialogue": "You're certainly headstrong enough."
  },
  {
    "name": "Kain",
    "dialogue": "No more holding back, Cecil. Fight to win this time! Return to the dragoon quarters."
  },
  {
    "name": "Cecil",
    "dialogue": "..."
  },
  {
    "name": "Kain",
    "dialogue": "Don't overthink things, Cecil. You need to keep your wits about you. Or do you mean to send me off against the Eidolon alone?"
  },
  {
    "name": "Cecil",
    "dialogue": "Of course not."
  },
  {
    "name": "Kain",
    "dialogue": "We leave early on the morrow. Best get some sleep. Cecil heads towards his tower."
  },
  {
    "name": "Voice",
    "dialogue": "Cecil! Cecil turns t find Rosa, White Mage of Baron and his girlfriend."
  },
  {
    "name": "Rosa",
    "dialogue": "Thank goodness! You're all right. The orders for Mysidia came so suddenly I'd worried."
  },
  {
    "name": "Cecil",
    "dialogue": "We're fine. Small wonder, considering we fought mages who did not fight back."
  },
  {
    "name": "Rosa",
    "dialogue": "Cecil! I'll visit you in your tower later."
  },
  {
    "name": "Cecil",
    "dialogue": "Of course. Rosa leaves."
  },
  {
    "name": "Voice",
    "dialogue": "Well, well! Look who's home! Cid, Airship Fleetmaster and friend to Cecil greets him at the entrance to his tower."
  },
  {
    "name": "Cid",
    "dialogue": "Rosa's been worried sick about you, you know! Make that girl cry and you'll have me to answer to, you hear? Speaking of girls, how're my babies? Didn't burn out any engines, did you? You and them goons of yours need to treat those ships with more respect! Hey...why the long face? Something the matter?"
  },
  {
    "name": "Cecil",
    "dialogue": "Cid, I, um... Cecil quickly retells the days events."
  },
  {
    "name": "Cid",
    "dialogue": "What!? And he's sending you to hunt the Eidolon instead? But what'll happen to the Red Wings without you? I tell you, something's gotten into His Majesty. He's ordered me to build a new ship, you know - a more maneuverable one, with more firepower. What's he thinking? I'm not building these things for him to wage war! There's talk among the townspeople, too. Everyone's worried about where Baron's headed. And now the king's sending you away from us! Mist, eh? Well, you take care of yourself. S'pose I don't need to worry about you, though, do I? I'd best be on my way, too. That daughter of mine is going to wring my neck if I spend another night here working without checking in at home! Cid leaves and Cecil meets his chambermaid leading up to his room."
  },
  {
    "name": "Maid",
    "dialogue": "I've turned your bed, my lord. They told me you would be departing again on the morrow. Rest well tonight. She leaves Cecil, who rests in preparation for his journey."
  }
]